#!/bin/bash
while true
do
clear
#### HEAD########################################################################
echo "                            
                                  WWW.CYBSECGROUP.COM  

    ხელსაწყოს რომელიც დაგეხმარებათ აღადგინოთ დაკარგული, წაშლილი ინფორმაცია ან მასალა!

      რეკომენდირებულია Kali ლინუქსის ოპერაციულ სისტემაზე! "#FORUM.CYBSECGROUP.COM"

>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>|
                                                                                  |
   '||''|.                              ..|'''.|                                  |
    ||   ||    ....    ....  ... ...  .|'     '    ...   .... ...   ....  ... ..  |
    ||    || .|...|| .|...||  ||'  || ||         .|  '|.  '|.  |  .|...||  ||' '' |
    ||    || ||      ||       ||    | '|.      . ||   ||   '|.|   ||       ||     |
   .||...|'   '|...'  '|...'  ||...'   ''|....'   '|..|'    '|     '|...' .||.    |
                              ||                                                  |
                             ''''                                                 |
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>|
                    

                     Forensics \e[93mვერსია: 1.0\e[0m 


     [\e[91m-------------------------------------------------\e[0m]
     [\e[91m---\e[0m]          კოდერი: CYBSECGROUP            [\e[91m---\e[0m]
     [\e[91m---\e[0m]   ინფორმაციული უსაფრთხოების ხელსაწყო    [\e[91m---\e[0m]
     [\e[91m-------------------------------------------------\e[0m]
     [\e[91m---\e[0m]           ..:.:\e[96mინსტრუქცია\e[0m:.:..       \e[0m   [\e[91m---\e[0m]
     [\e[91m-------------------------------------------------\e[0m]
     [\e[91m---\e[0m]   \e[91m1\e[0m) \e[96mფლეშკიდან ინფორმაციის აღდგენა\e[0m      [\e[91m---\e[0m]
     [\e[91m---\e[0m]   \e[91m2\e[0m) \e[96mდისკიდან ინფორმაციის აღდგენა\e[0m       [\e[91m---\e[0m]
     [\e[91m---\e[0m]   \e[91m3\e[0m) \e[96mბრაუზერიდან ინფორმაციის აღდგენა\e[0m    [\e[91m---\e[0m]
     [\e[91m---\e[0m]   \e[91m4\e[0m) \e[96mდახმარება\e[0m                          [\e[91m---\e[0m]
     [\e[91m---\e[0m]   \e[91m5\e[0m) \e[96mგანახლება\e[0m                          [\e[91m---\e[0m]
     [\e[91m---\e[0m]   \e[91mX\e[0m) \e[96mგასვლა\e[0m                             [\e[91m---\e[0m]
     [\e[91m-------------------------------------------------\e[0m]
     [\e[91m„\e[0mკიბერ უსაფრთხოების ჯგუფი, Cyber Security Group \e[91m“\e[0m]
"

#### PROMPT###############################################################

     echo -n "\e[91m არჩევა:~$ \e[0m"
read anwser
case "$anwser" in

#MENU#### AUTO############################################################

1) echo -n "[\e[91m-------------------------------------------------\e[0m]
\e[33mფლეშკის შეერთების შემდეგ ვაჭერთ ENTER\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
sleep 10 && 
echo "\e[33mკოდი გააქტიურდა...\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
mkdir CYBSECrecoverUsb && 
echo "\e[33mშეიქმნა განყოფილება CYBSECForensics...\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
cd CYBSECrecoverUsb &&  
dir /dev/sdb && 
echo "\e[33mმიმდინარეობს ფაილების წაკითხვა...\e[0m
[\e[91m-------------------------------------------------\e[0m]" &&
echo -n "-_*/მიუთითე სახელი/>"
read name 
xterm -e dcfldd if=/dev/sdb of="$name".dd && 
echo "\e[33mფაილები წაკითხულია...\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
mkdir MetaDataxD && 
cd MetaDataxD && 
echo "\e[33mმიმდინარეობს გაშიფრვა...\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
xterm -e foremost -a -T -i ../$name.dd && 
echo "\e[33m ინფორმაცია ინახება \e[91m$PWD/CYBSECGROUP/MetaDataxD\e[0m-ს განყოფილებაში. 
ასევე გვეწვიეთ ფორუმზე FORUM.CYBSECGROUP.COM \e[0m
[\e[91m-------------------------------------------------\e[0m]" ;;

#### MANUAL###############################################################

2) echo "[\e[91m-------------------------------------------------\e[0m]
\e[33mშეკუმშვა და გადმოტანა დაიწყება 5 წამში...\e[0m"
sleep 10 && 
echo "[\e[91m-------------------------------------------------\e[0m]
\e[33mკოდი გააქტიურდა...\e[0m" && 
mkdir CYBSECrecoverHDD && 
echo "[\e[91m-------------------------------------------------\e[0m]
\e[33mშეიქმნა განყოფილება CYBSECGROUP\e[0m" && 
cd CYBSECrecoverHDD &&
echo "[\e[91m-------------------------------------------------\e[0m]
\e[33mდისკების ჩამონათვალი...\e[0m"
echo "[\e[91m-------------------------------------------------\e[0m]" &&
dir /dev/sd* |grep "/dev/sd*" --color&&
echo "[\e[91m-------------------------------------------------\e[0m]" &&
fdisk -l | grep "/dev/sd*" --color &&
echo -n "აირჩიეთ დისკების ჩამონათვალი. მაგალითად:(/dev/sda* ან /dev/sdb*): "
read sd
echo "\e[33mმიმდინარეობს ფაილების წაკითხვა...\e[0m
[\e[91m-------------------------------------------------\e[0m]"
echo -n "-_*/მიუთითეთ სახელი/>"
read namee
xterm -e dcfldd if=$sd of=$namee.dd
echo "\e[33mფაილები წაკითხულია...\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
mkdir MetaDataxD && 
cd MetaDataxD && 
echo "\e[33mაირჩიეთ ფორმატი. მაგალითად exe,jpg,php,txt,rar და ა.შ\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
echo -n "-_*/მიუთითეთ ფორმატი/>"
read choose
echo "\e[33mმიმდინარეობს გაშიფვრა...\e[0m
[\e[91m-------------------------------------------------\e[0m]" && 
xterm -e foremost -T -t $choose -i ../$namee.dd && 
echo "\e[33m ინფორმაცია ინახება $PWD/CYBSECGROUP/MetaDataxD-ს განყოფილებაში. 
ასევე გვეწვიე ფორუმზე FORUM.CYBSECGROUP.COM \e[0m
[\e[91m-------------------------------------------------\e[0m]" 
 ;;

### Browser################################################################

3) echo "[\e[91m-------------------------------------------------\e[0m]
იძებნება ფაილი...
[\e[91m-------------------------------------------------\e[0m]" && cp -r /root/.mozilla/firefox/ HistoryCache &&echo "მოიძებნა ფაილი
[\e[91m-------------------------------------------------\e[0m]" && echo "მიმდინარეობს ფაილის გამზადება..
[\e[91m-------------------------------------------------\e[0m]" && mv HistoryCache/*.default/ Log && rm -r HistoryCache && echo -n "ფაილის ჩასატვირთათ აირჩიეთ ტიპი:"  
echo "--All | --Cookies | --Permissions | --Downloads | --Forms | --History | --Bookmarks | --Passwords | --Session | --Watch"
read logs
dumpzilla 'Log' $logs;;

#### EXIT##################################################################

X) exit ;;

#### HELP##################################################################

4) echo "\e[96m - პროგრამა მუშაობს სატესტო რეჟიმში, მისი მეშვეობით შეგიძლიათ აღადგინოთ ფლეშკიდან დაკარგული ინფორმაცია
USB Flash, CD/DVD RW, Browser. სურათები,პროგრამები,ტექსტური ფაილები და სხვა თქვენთვის საჭირო დოკუმენტები
           
1) ფლეშკიდან ავტომატური აღდგენა
2) დისკიდან ინფორმაციის აღდგენა
3) ბრაუზერიდან ინფორმაციის აღდგენა 
4) დახმარება
5) განახლება                                                            
X) გასვლა CYBSECGROUP ტერმინალიდან                            \e[0m" ;;
5) echo "მიმდინარეობს განახლება..." && 
sleep 3 && 
xterm -e git clone https://github.com/CYBSECGROUP/DEEPRECOVER.git ;;
esac 

#### RELOAD#################################################################

echo "\e[91m---------------> დააჭირე ენთერს\e[0m"
read input
done
